#include <iostream>
#include <windows.h>
using namespace std;

#define X 6

/*
«Медичне дослідження»
Для відбору для участі в медичному дослідженні було залучено N кандидатів. В результаті оцінювання показників кандидатів за деякими критеріями, кожен з них отримав бал за шкалою від 0 до 10, який визначає ступінь його придатності до участі в дослідженні.
Кандидати, які набрали менше Х балів, не підходять для участі в дослідженні.
Програма повинна сформувати по вхідному набору показників всіх N кандидатів набір тільки тих, хто придатний до участі в дослідженні.
Якщо в результаті відбору жоден з кандидатів не набрав необхідної кількості балів, вивести відповідне повідомлення.
Завдання:
 Сформувати новий масив з даними тих кандидатів, які придатні до участі.
При реалізації використовувати динамічнні масиви.
Програма повинна реалізовувати наступний алгоритм:
1. Задати з клавіатури кількість кандидатів.
2. Створити динамічний масив з даними кандидатів.
3. Розрахувати кількість кандидатів, що підходять для дослідження.
4. Якщо кількість кандидатів >0, то створити новий динамічний масив для "правильних" кандидатів, перенести туди "правильні" дані та вивести масив на екран.
Інакше, вивести повідомлення про відсутність підходящих кандидатів.
*/

int main() {
  SetConsoleCP(1251);
  SetConsoleOutputCP(1251);

  // Кількість кандидатів
  int N;
  do {
    cout << "Введіть кількість кандидатів: ";
    cin >> N;

    if (N < 0 || N > 10) cout << "Помилка! Введіть знову.." << endl;
  } while (N < 0 || N > 10);

  // бали всіх кандидатів
  int* scores = new int[N];

  for (int i = 0; i < N; i++) {
    do {
      cout << "Введіть бал " << (i + 1) << " учасника: ";
      cin >> scores[i];

      if (scores[i] < 0 || scores[i] > 10) cout << "Помилка! Введіть знову.." << endl;
    } while (scores[i] < 0 || scores[i] > 10);
  }

  // кандидати що пройшли відбір
  int* suitableCandidates = new int[N];
  int suitableCount = 0;

  for (int i = 0; i < N; i++) {
    if (scores[i] >= X) {
      suitableCandidates[suitableCount] = scores[i];
      suitableCount++;
    }
  }

  if (suitableCount > 0) {
    cout << "Бали кандидатів що пройшли відбір: " << endl;

    for (int i = 0; i < suitableCount; i++) {
      cout << suitableCandidates[i] << " балів" << endl;
    }
  } else {
    cout << "Ніхто з кандидатів не пройшов відбір!" << endl;
  }

  delete[] scores;
  delete[] suitableCandidates;
  return 0;
}